In [3]:
import numpy as np
import pandas as pd

In [4]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [5]:
obj[2:4]   # Simple Slicing concept, in which last index is exclusive because of presence of in between indexes.
           # 4th index is exclusive.

c    2.0
d    3.0
dtype: float64

In [6]:
obj['b':'c']     # Special case of Slicing in which there is no any index exist between two provided indexes for slicing.
                 # As there is no index between 'b' and 'c' so no index is exclusive.

b    1.0
c    2.0
dtype: float64

In [8]:
obj['b':'c'] = 5       # Value is updating.
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [17]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
        index=['Ohio', 'Colorado', 'Utah', 'New York'],
        columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [18]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [20]:
data.loc['Colorado']    # To get row, we must provide 'loc' or 'iloc' method.

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [22]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [23]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [43]:
data.loc['Colorado', ['two', 'three']]     # Providing a row not a column.

two      5
three    6
Name: Colorado, dtype: int64

In [49]:
data.iloc[1, [1,2]]       # Providing By-Default indexes.

two      5
three    6
Name: Colorado, dtype: int64

In [34]:
#print(data)
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [35]:
data[data['one'] > 5]

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [39]:
 data < 5       # True or False Representation.

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [ ]:
[ data < 5]   # Data frame

In [38]:
 data[data < 5]     # True or False.

          one  two  three  four
Ohio      0.0  1.0    2.0   3.0
Colorado  4.0  NaN    NaN   NaN
Utah      NaN  NaN    NaN   NaN
New York  NaN  NaN    NaN   NaN

In [45]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [50]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [51]:
 data.iloc[:, :3]

          one  two  three
Ohio        0    0      0
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [52]:
 data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [55]:
index=                                   0,   1,   2   # +ve-index
 ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])
 ser2
index=                                  -3   -2   -1   # -ve -index

a    0.0
b    1.0
c    2.0
dtype: float64

In [54]:
ser2[-1]

2.0

In [56]:
ser2[2]

2.0